///////////////////////////////////////////////////////
//
// Тесты сопряжений.
//
///////////////////////////////////////////////////////

#ifndef __TEST_MATES_H
#define __TEST_MATES_H


//------------------------------------------------------------------------------
/// Создать куб(стена, линия) из жестко соединенных кирпичей.
// ---
bool RigidConnectedBricks();


//------------------------------------------------------------------------------
/// Создать сборку - фрактал.
// ---
bool MateFractal();


//------------------------------------------------------------------------------
/// Создать сборку сопряженных блоков с распределенными степенями свободы.
// ---
bool DistributedDoFMates();


//------------------------------------------------------------------------------
/// Общий тест всех типов сборок.
// ---
bool CommonMatesTest();

//------------------------------------------------------------------------------
/// Создать линейный массив компонент.
// ---
bool LinearPattern();

//------------------------------------------------------------------------------
/// Создать угловой массив компонент.
// ---
bool AngularPattern();

#endif // __TEST_MATES_H
